tests/performance/load-test.yml
config:
  target: "http://localhost:8000"

  phases:
    - duration: 10
      arrivalRate: 1
      name: Warm-up

    - duration: 20
      arrivalRate: 2
      rampTo: 5
      name: Montee en charge

    - duration: 10
      arrivalRate: 5
      name: Charge stable

  ensure:
    maxErrorRate: 1
    thresholds:
      - "http.response_time.p95": 500

scenarios:
  - name: Consultation des emotions generales
    flow:
      - get:
          url: "/api/emotion_generales"
          expect:
            - statusCode: 200